{"class_name": "Model", "config": {"name": "model-b68df", "layers": [{"name": "input-3060e", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 1], "dtype": "float32", "sparse": false, "name": "input-3060e"}, "inbound_nodes": []}, {"name": "flatten-f00db", "class_name": "Flatten", "config": {"name": "flatten-f00db", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["input-3060e", 0, 0, {}]]]}, {"name": "dense-de1d5", "class_name": "Dense", "config": {"name": "dense-de1d5", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten-f00db", 0, 0, {}]]]}, {"name": "output-32b0a", "class_name": "Dense", "config": {"name": "output-32b0a", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense-de1d5", 0, 0, {}]]]}], "input_layers": [["input-3060e", 0, 0]], "output_layers": [["output-32b0a", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}