{"class_name": "Model", "config": {"name": "model-a6e86", "layers": [{"name": "input-35d15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input-35d15"}, "inbound_nodes": []}, {"name": "flatten-519c8", "class_name": "Flatten", "config": {"name": "flatten-519c8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["input-35d15", 0, 0, {}]]]}, {"name": "dense-1e5d5", "class_name": "Dense", "config": {"name": "dense-1e5d5", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten-519c8", 0, 0, {}]]]}, {"name": "output-3dd48", "class_name": "Dense", "config": {"name": "output-3dd48", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense-1e5d5", 0, 0, {}]]]}], "input_layers": [["input-35d15", 0, 0]], "output_layers": [["output-3dd48", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}