{"class_name": "Model", "config": {"name": "siamese_model-2f933", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "model-39c51", "class_name": "Model", "config": {"name": "model-39c51", "layers": [{"name": "input-87016", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input-87016"}, "inbound_nodes": []}, {"name": "flatten-dfe85", "class_name": "Flatten", "config": {"name": "flatten-dfe85", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["input-87016", 0, 0, {}]]]}, {"name": "dense-ce230", "class_name": "Dense", "config": {"name": "dense-ce230", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten-dfe85", 0, 0, {}]]]}, {"name": "output-c07ff", "class_name": "Dense", "config": {"name": "output-c07ff", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense-ce230", 0, 0, {}]]]}], "input_layers": [["input-87016", 0, 0]], "output_layers": [["output-c07ff", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "model-53b66", "class_name": "Model", "config": {"name": "model-53b66", "layers": [{"name": "input-cdab2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input-cdab2"}, "inbound_nodes": []}, {"name": "flatten-5debe", "class_name": "Flatten", "config": {"name": "flatten-5debe", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["input-cdab2", 0, 0, {}]]]}, {"name": "dense-bd274", "class_name": "Dense", "config": {"name": "dense-bd274", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten-5debe", 0, 0, {}]]]}, {"name": "output-9987e", "class_name": "Dense", "config": {"name": "output-9987e", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense-bd274", 0, 0, {}]]]}], "input_layers": [["input-cdab2", 0, 0]], "output_layers": [["output-9987e", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "subtract-e3aea", "class_name": "Subtract", "config": {"name": "subtract-e3aea", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["model-39c51", 1, 0, {}], ["model-53b66", 1, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["subtract-e3aea", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}